In [1]:
import numpy as np
import pandas as pd

In [2]:
diccionario = {'A':[4,5,np.nan],'B':[6,4,5],'C':[np.nan,4,np.nan]}

In [3]:
dataframe = pd.DataFrame(diccionario)

In [4]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  4  4.0
2  NaN  5  NaN

In [5]:
dataframe.dropna()

     A  B    C
1  5.0  4  4.0

In [8]:
dataframe.dropna(axis=1,  inplace=False)

   B
0  6
1  4
2  5

In [9]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  4  4.0
2  NaN  5  NaN

In [10]:
dataframe.fillna(value=100)

       A  B      C
0    4.0  6  100.0
1    5.0  4    4.0
2  100.0  5  100.0

In [11]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    5.0
C    4.0
dtype: float64

In [12]:
dataframe.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  4  4.0
2  4.5  5  4.0